# Brewfile
# Install: brew bundle install

# Taps
tap "anomalyco/tap"
tap "fenio/tap"
tap "nickustinov/tap"
tap "oven-sh/bun"

# Shell & Terminal
brew "neovim"
brew "oh-my-posh"
brew "tmux"
brew "tree-sitter"
brew "zsh"
cask "iterm2"

# File Navigation & Search
brew "fd"
brew "fzf"
brew "midnight-commander"
brew "ripgrep"
brew "tealdeer"
brew "tree"
brew "zoxide"

# Git
brew "gh"
brew "git"
brew "pre-commit"
cask "git-credential-manager"

# Languages & Runtimes
brew "deno"
brew "go"
brew "lua"
brew "node"
brew "oven-sh/bun/bun"
brew "ruby"
brew "uv"

# Apple/iOS Development
brew "swiftgen"
brew "swiftlint"
brew "xcbeautify"
brew "xcode-build-server"
brew "xcodegen"
brew "xcinfo"

# Android
cask "android-platform-tools"

# C/C++ Toolchain
brew "arm-linux-gnueabihf-binutils"
brew "cmake"
brew "dtc"
brew "gcc"
brew "make"

# Linters & Formatters
brew "clang-format"
brew "cppcheck"
brew "eslint"
brew "goimports"
brew "prettier"
brew "ruff"
brew "shellcheck"
brew "stylua"
brew "swift-format"

# LSP Servers
brew "bash-language-server"
brew "gopls"
brew "lua-language-server"
brew "pyright"
brew "ruby-lsp"
brew "typescript-language-server"

# Networking
brew "curl"
brew "nmap"
brew "telnet"
brew "wget"

# Containers & Virtualization
brew "podman"
brew "podman-compose"

# AI & LLM
brew "anomalyco/tap/opencode"
cask "copilot-cli"
cask "lm-studio"

# Development Tools
brew "hugo"
brew "sqlite"
cask "dbeaver-community"
cask "devcleaner"
cask "icon-composer"
cask "sf-symbols"
cask "visual-studio-code"

# Utilities
brew "cloc"
brew "coreutils"
brew "diffutils"
brew "gnupg"
brew "jq"
brew "mas"
brew "stow"
brew "topgrade"

# System & Maintenance
cask "betterdisplay"
cask "linearmouse"
cask "onyx"
cask "pearcleaner"
cask "stats"
cask "thaw"

# Productivity
cask "fenio/tap/anylinuxfs-gui"
cask "nickustinov/tap/itsypad"
cask "meetingbar"
cask "mountain-duck"
cask "tailscale-app"

# Media & Communication
brew "pngquant"
cask "discord"
cask "iina"
cask "pinta"
cask "steam"
cask "transmission"
cask "whatsapp"

# Browsers
cask "firefox"
cask "microsoft-edge"

# Fonts
cask "font-fira-code-nerd-font"

# Office
cask "intune-company-portal"
cask "libreoffice"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-outlook"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"

# Mac App Store
mas "Bitwarden", id: 1352778147
mas "TestFlight", id: 899247664
mas "uBlock Origin Lite", id: 6745342698
mas "Userscripts", id: 1463298887
mas "Xcode", id: 497799835
