# Brewfile - Generated on 2025-12-29
# Install with: brew bundle --file=~/Desktop/Brewfile
# NOTE: macOS-specific. Some packages (android-*, xcode-*) won't work on Linux.

# ==============================================================================
# FORMULAE - Command-line tools and libraries
# ==============================================================================

# ------------------------------------------------------------------------------
# Shell & Terminal
# ------------------------------------------------------------------------------
brew "zsh"                              # UNIX shell (command interpreter)
brew "zsh-autosuggestions"              # Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-completions"                  # Additional completion definitions for zsh
brew "zsh-fast-syntax-highlighting"     # Feature-rich syntax highlighting for Zsh
brew "tmux"                             # Terminal multiplexer
brew "neovim"                           # Ambitious Vim-fork focused on extensibility and agility

# ------------------------------------------------------------------------------
# File Management & Navigation
# ------------------------------------------------------------------------------
brew "fd"                               # Simple, fast and user-friendly alternative to find
brew "fzf"                              # Command-line fuzzy finder written in Go
brew "tree"                             # Display directories as trees (with optional color/HTML output)
brew "bat"                              # Clone of cat(1) with syntax highlighting and Git integration
brew "ripgrep"                          # Search tool like grep and The Silver Searcher
brew "midnight-commander"               # Terminal-based visual file manager
brew "stow"                             # Organize software neatly under a single directory tree
brew "zoxide"                           # Shell extension to navigate your filesystem faster
brew "tealdeer"                         # Very fast implementation of tldr in Rust

# ------------------------------------------------------------------------------
# Version Control
# ------------------------------------------------------------------------------
brew "git"                              # Distributed revision control system
brew "git-credential-manager"           # Cross-platform Git credential storage
brew "difftastic"                       # Structural diff that understands syntax
brew "kdiff3"                           # 3-way merge tool for resolving conflicts
brew "gh"                               # GitHub command-line tool
brew "tig"                              # Text interface for Git repositories

# ------------------------------------------------------------------------------
# Programming Languages & Runtimes
# ------------------------------------------------------------------------------
brew "python@3.13"                      # Interpreted, interactive, object-oriented programming language
brew "pipx"                             # Execute binaries from Python packages in isolated environments
brew "go"                               # Open source programming language to build simple/reliable/efficient software
brew "deno"                             # Secure runtime for JavaScript and TypeScript
brew "ruby"                             # Powerful, clean, object-oriented scripting language
brew "lua"                              # Powerful, lightweight programming language
brew "luajit"                           # Just-In-Time Compiler for Lua
brew "zig"                              # Programming language designed for robustness, optimality, and clarity
brew "rustup"                           # Rust toolchain installer
brew "oven-sh/bun/bun"                  # Fast all-in-one JavaScript runtime
brew "typescript"                       # Language for application scale JavaScript development

# ------------------------------------------------------------------------------
# Swift & iOS Development
# ------------------------------------------------------------------------------
brew "swiftgen"                         # Swift code generator for assets, storyboards, Localizable.strings, etc.
brew "swiftlint"                        # Tool to enforce Swift style and conventions
brew "swiftly"                          # Swift toolchain installer and manager
brew "xcbeautify"                       # Little beautifier tool for xcodebuild
brew "xcinfo"                           # Tool to access Xcode information
brew "xcode-build-server"               # Build server for Xcode projects
brew "xcodegen"                         # Generate your Xcode project from a spec file and your folder structure

# ------------------------------------------------------------------------------
# Build Tools
# ------------------------------------------------------------------------------
brew "cmake"                            # Cross-platform make
brew "ninja"                            # Small build system for use with gyp or CMake
brew "make"                             # Utility for directing compilation
brew "gradle"                           # Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle-completion"                # Bash and Zsh completion for Gradle
brew "autoconf"                         # Automatic configure script builder
brew "automake"                         # Tool for generating GNU Standards-compliant Makefiles
brew "m4"                               # Macro processing language

# ------------------------------------------------------------------------------
# C/C++ Development
# ------------------------------------------------------------------------------
brew "gcc"                              # GNU compiler collection
brew "llvm"                             # Next-gen compiler infrastructure
brew "clang-format"                     # Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "cppcheck"                         # Static analysis of C and C++ code
brew "gdb"                              # GNU debugger

# ------------------------------------------------------------------------------
# Networking
# ------------------------------------------------------------------------------
brew "curl"                             # Get a file from an HTTP, HTTPS or FTP server
brew "wget"                             # Internet file retriever
brew "httpie"                           # User-friendly cURL replacement (command-line HTTP client)
brew "nmap"                             # Port scanning utility for large networks
brew "iperf3"                           # Tool to measure TCP, UDP, and SCTP bandwidth

# ------------------------------------------------------------------------------
# Text Processing & JSON
# ------------------------------------------------------------------------------
brew "jq"                               # Lightweight and flexible command-line JSON processor
brew "glow"                             # Render markdown on the CLI
brew "shellcheck"                       # Static analysis and lint tool, for (ba)sh scripts
brew "eslint"                           # AST-based pattern checker for JavaScript
brew "prettier"                         # Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "black"                            # Python code formatter
brew "ruff"                             # Extremely fast Python linter, written in Rust
brew "pre-commit"                       # Framework for managing multi-language pre-commit hooks
brew "stylua"                           # Opinionated Lua code formatter
brew "gemini-cli"                       # Interact with Google Gemini AI models from the command-line

# ------------------------------------------------------------------------------
# System Utilities
# ------------------------------------------------------------------------------
brew "htop"                             # Improved top (interactive process viewer)
brew "topgrade"                         # Upgrade all the things
brew "coreutils"                        # GNU File, Shell, and Text utilities
brew "diffutils"                        # File comparison utilities
brew "cloc"                             # Statistics utility to count lines of code
brew "mas"                              # Mac App Store command-line interface

# ------------------------------------------------------------------------------
# Compression
# ------------------------------------------------------------------------------
brew "gzip"                             # Popular GNU data compression program
brew "lz4"                              # Extremely fast compression algorithm
brew "lzo"                              # Real-time data compression library
brew "xz"                               # General-purpose data compression with high compression ratio
brew "zstd"                             # Zstandard - Fast real-time compression algorithm
brew "zip"                              # Compression and file packaging/archive utility
brew "unzip"                            # Extraction utility for .zip compressed archives

# ------------------------------------------------------------------------------
# Static Site & Documentation
# ------------------------------------------------------------------------------
brew "hugo"                             # Configurable static site generator

# ------------------------------------------------------------------------------
# Image Processing
# ------------------------------------------------------------------------------
brew "pngquant"                         # PNG image optimizing utility

# ------------------------------------------------------------------------------
# Security & Encryption
# ------------------------------------------------------------------------------
brew "gnupg"                            # GNU Privacy Guard (OpenPGP)
brew "pinentry"                         # Passphrase entry dialog utilizing the Assuan protocol

# ------------------------------------------------------------------------------
# iOS Binary Tools
# ------------------------------------------------------------------------------
brew "ldid"                             # Lets you manipulate the signature block in a Mach-O binary

# ------------------------------------------------------------------------------
# Database
# ------------------------------------------------------------------------------
brew "sqlite"                           # Command-line interface for SQLite

# ------------------------------------------------------------------------------
# Parser & Syntax Libraries
# ------------------------------------------------------------------------------
brew "tree-sitter"                      # Incremental parsing library
brew "oniguruma"                        # Regular expressions library
brew "readline"                         # Library for command-line editing

# ==============================================================================
# CASKS - GUI Applications
# ==============================================================================



# ------------------------------------------------------------------------------
# Development Tools
# ------------------------------------------------------------------------------
cask "android-commandlinetools"         # Android SDK command-line tools
cask "android-ndk"                      # Android Native Development Kit
cask "android-platform-tools"           # Android SDK Platform-Tools (adb, fastboot)
cask "claude-code"                      # Anthropic's Claude AI coding assistant CLI
cask "codex"                            # OpenAI Codex CLI coding agent
cask "copilot-cli"                      # GitHub Copilot in the CLI
cask "docker"
cask "devcleaner"
cask "iterm2"                           # Terminal emulator for macOS

# ------------------------------------------------------------------------------
# Productivity & Office
# ------------------------------------------------------------------------------
cask "libreoffice"                      # Free and open-source office suite
cask "coteditor"                        # Lightweight plain-text editor for macOS

# ------------------------------------------------------------------------------
# Web Browsers
# ------------------------------------------------------------------------------
cask "ungoogled-chromium"               # Chromium without Google integration

# ------------------------------------------------------------------------------
# Communication
# ------------------------------------------------------------------------------
cask "whatsapp"                         # WhatsApp desktop client

# ------------------------------------------------------------------------------
# System Utilities
# ------------------------------------------------------------------------------
cask "alt-tab"                          # Windows-like alt-tab window switcher
cask "bitwarden"                        # Password manager
cask "hiddenbar"                        # Hide menu bar icons
cask "meetingbar"                       # Menu bar app for calendar meetings

# ------------------------------------------------------------------------------
# Fonts
# ------------------------------------------------------------------------------
cask "font-jetbrains-mono-nerd-font"    # JetBrains Mono with Nerd Font icons

# ==============================================================================
# MAC APP STORE - Apps installed via App Store
# ==============================================================================

mas "Interactful", id: 1528095640       # Interactive widgets and tools
mas "TestFlight", id: 899247664         # Beta testing platform for iOS apps
mas "uBlock Origin Lite", id: 6745342698  # Lightweight content blocker
mas "Userscripts", id: 1463298887       # Safari userscript manager
mas "Xcode", id: 497799835              # Apple's integrated development environment
