# Brewfile
# Install: brew bundle install

tap "oven-sh/bun"

# Shell & Terminal
brew "oh-my-posh"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-fast-syntax-highlighting"
brew "tmux"
brew "neovim"

# File Navigation & Search
brew "fd"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "tree"
brew "zoxide"
brew "midnight-commander"
brew "tealdeer"

# Git
brew "git"
cask "git-credential-manager"
brew "gh"
brew "tig"
brew "difftastic"
cask "kdiff3"

# Languages
brew "node"
brew "uv"
brew "go"
brew "zig"
brew "ruby"
brew "lua"
brew "luajit"
brew "oven-sh/bun/bun"
brew "deno"
brew "typescript"

# Apple/iOS Development
brew "swiftlint"
brew "swiftgen"
brew "xcodegen"
brew "xcode-build-server"
brew "xcbeautify"
brew "xcinfo"

# C/C++ Toolchain
brew "gcc"
brew "gdb"
brew "cmake"
brew "ninja"
brew "make"

# Linters & Formatters
brew "shellcheck"
brew "prettier"
brew "eslint"
brew "black"
brew "ruff"
brew "clang-format"
brew "cppcheck"
brew "stylua"
brew "pre-commit"

# Networking
brew "curl"
brew "wget"
brew "httpie"
brew "nmap"

# Utilities
brew "jq"
brew "glow"
brew "coreutils"
brew "diffutils"
brew "topgrade"
brew "cloc"
brew "mas"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "sqlite"
brew "pngquant"
brew "hugo"
brew "gnupg"

# Development
cask "iterm2"
cask "visual-studio-code"
cask "docker-desktop"
cask "claude"
cask "claude-code"
cask "dbeaver-community"
cask "devcleaner"

# Productivity & Utilities
cask "tailscale"
cask "coteditor"
cask "alt-tab"
cask "hiddenbar"
cask "meetingbar"
cask "linearmouse"
cask "mountain-duck"
cask "pearcleaner"

# Media & Communication
cask "iina"
cask "pinta"
cask "whatsapp"
cask "discord"
cask "steam"

# Browsers
cask "ungoogled-chromium"

# Fonts
cask "font-fira-code-nerd-font"

# Microsoft Office
cask "microsoft-word"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-outlook"
cask "microsoft-teams"
cask "intune-company-portal"

# Mac App Store
mas "Xcode", id: 497799835
mas "TestFlight", id: 899247664
mas "uBlock Origin Lite", id: 6745342698
mas "Userscripts", id: 1463298887
mas "Bitwarden", id: 1352778147
